fireFoam-1.6-1.0/tutorials/CoFlowFlame2D/constant/betaPdfCoeff.txt
0.0000000000001421085471520200371742248535156250000
-0.3070744278793426929041743278503417968750000000000
77.5044517011265270411968231201171875000000000000000
-5412.7514402470551431179046630859375000000000000000000
166783.9269544370472431182861328125000000000000000000000
-2844829.6539873927831649780273437500000000000000000000000
30990470.8953833580017089843750000000000000000000000000000
-233545814.4828672409057617187500000000000000000000000000000
1278340039.5567655563354492187500000000000000000000000000000
-5244441866.8621520996093750000000000000000000000000000000000
16461125493.7862396240234375000000000000000000000000000000000
-40042578142.5770874023437500000000000000000000000000000000000
76003414409.0215148925781250000000000000000000000000000000000
-112708092927.4680175781250000000000000000000000000000000000000
130016885543.9840393066406250000000000000000000000000000000000
-115396749381.8910064697265625000000000000000000000000000000000
77246797136.4800872802734375000000000000000000000000000000000
-37707567599.1072692871093750000000000000000000000000000000000
12662362864.6341838836669921875000000000000000000000000000000
-2614390661.9065308570861816406250000000000000000000000000000
250133818.21779784560203552246093750000000000000000000000
